{
  "pmtoolsPaper": {
    "citeRu": "Ефремов И.В., Веселовский Р.В. PMTools: новое программное обеспечение для анализа палеомагнитных данных // Физика Земли. №5. 2023. С. 150-158. DOI:10.31857/S0002333723050022",
    "citeEn": "Efremov I.V., Veselovskiy R.V. PMTools: New Application for Paleomagnetic Data Analysis // Izvestiya, Physics of the Solid Earth. 2023. Vol. 59. No. 5. pp. 798–805. DOI:10.1134/S1069351323050026.",
    "doiRu": "10.31857/S0002333723050022",
    "doiEn": "10.1134/S1069351323050026",
    "aboutRu": "Статья на русском",
    "aboutEn": "Статья на английском",
    "openArticleRu": "Открыть статью (RU)",
    "openArticleEn": "Открыть статью (EN)"
  },
  "mainLayout": {
    "navPanel": {
      "whyPMTools": "Почему PMTools?",
      "PCA": "Магнитные чистки (PCA)",
      "DIR": "Статистика направлений (DIR)",
      "projectRepo": "Репозиторий проекта",
      "authorsAndHistory": "Авторы и история"
    },
    "footer": {
      "rights": "© 2022 PMTools 2.0. Все права защищены.",
      "license": "Продукт поставляется под лицензией MIT.",
      "source": "Если вы используете приложение PMTools в своем исследовании, просим сослаться на публикацию: Ефремов И.В., Веселовский Р.В. PMTools: новое программное обеспечение для анализа палеомагнитных данных // Физика Земли. №5. 2023. С. 150-158. DOI:10.31857/S0002333723050022"
    }
  },
  "mainPage": {
    "about": {
      "firstLine": "Работайте с результатами палеомагнитных исследований.",
      "secondLine": "В любое время, в любом месте, с любого устройства.",
      "thirdLine": "И не беспокойтесь о защите данных.",
      "startWork": "Приступить к работе",
      "aboutPMToolsPaper": "Ознакомьтесь со статьей про возможности PMTools",
      "pleaseCitePMTools": "Если вы используете приложение PMTools в своем исследовании, просим сослаться на публикацию"
    },
    "description": {
      "tools": "PMTools — веб-приложение, включающее в себя множество инструментов для статистической обработки данных, полученных в ходе палеомагнитных исследований.",
      "privacy": "PMTools имеет открытый исходный код и не имеет связи ни с какими другими приложениями и серверами. Все данные хранятся и обрабатываются только на стороне пользователя.",
      "modules": "В PMTools имеются все необходимые инструменты для компонентного анализа (модуль PCA) и статистики векторов на сфере (модуль DIR).",
      "table": "PMTools поддерживает импорт таких форматов данных, как PMD, DIR, PMM. В этих же форматах может быть произведён экспорт любых табличных данных из PMTools. Более того, возможен экспорт данных в форматах XLSX и CSV.",
      "graph": "Все графики и диаграммы, генерируемые в ходе обработки данных в PMTools, могут быть экспортированы в векторном формате и имеют идеально подготовленную для редактирования внутреннюю структуру."
    },
    "featuresCards": {
      "pca": {
        "title": "Проводите компонентный анализ",
        "description": "Страница магнитных чисток (PCA) предоставляет классические инструменты для выделения компонент намагниченности. Работайте напрямую с коллекцией образцов и экспортируйте выделенные направления в любом удобном формате."
      },
      "dir": {
        "title": "Изучайте распределения направлений",
        "description": "Страница статистики направлений (DIR) даёт возможность найти средние направления различными методами. И на этой же странице вы можете провести палеомагнитные статистические тесты для проверки своих гипотез."
      },
      "vgp": {
        "title": "Находите виртуальные геомагнитные полюса",
        "description": "Для расчёта полюсов достаточно на странице DIR открыть соответствующий модуль и просто ввести или импортировать координаты точек отбора образцов (можно даже из XLSX файла). И полученные VGP можно тут же экспортировать в формате, подходящем для программ GPLates и GMap."
      },
      "selection": {
        "title": "Взаимодействие с данными ещё не было столь простым",
        "description": "Все данные в PMTools представлены в виде таблиц и графиков, которые напрямую связаны между собой — вы можете выбирать нужные вам направления (точки) прямиком из таблиц, обводя их на графиках, или просто вводя их через в специальное поле."
      },
      "exportData": {
        "title": "Работайте с данными в любом формате",
        "description": "Встроенный в PMTools конвертер форматов хранения палеомагнитных данных позволяет вам импортировать классические форматы данных и экспортировать их в любой удобный формат, в том числе в Excel."  
      },
      "exportGraphs": {
        "title": "Забудьте о трудностях при работе с графикой",
        "description": "Все графики и диаграммы в PMTools написаны с нуля специально для отображения палеомагнитных данных — все они заранее подготовлены для использования в публикациях и презентациях, а при их экспорте вы получите SVG файл с понятной и легко редактируемой структурой."
      },
      "darkTheme": {
        "title": "Комфортная работа в любое время суток",
        "description": "В PMTools вы можете переключиться на тёмную тему и комфортно работать в полной темноте."
      }
    }
  },
  "whyPMToolsPage": {
    "headline": "PMTools — новейшее программное обеспечение для статистической обработки и визуализации палеомагнитных данных",
    "importAndExport": {
      "title": "Импорт и экспорт данных",
      "lines": {
        "first": "PMTools позволяет вам работать с такими форматами, как:",
        "second": "а также с их структурными аналогами в форматах <strong>.csv</strong> и <strong>.xlsx</strong>. Более того, все эти форматы доступны не только для импорта, но и для экспорта. То есть вы можете загрузить свой .pmd или .dir файл и затем экспортировать его как .xlsx, получив таким образом все преимущества работы с данными в Microsoft Excel. Обратное также возможно!",
        "third": "Более того, вы можете экспортировать данные по рассчитанным виртуальным геомагнитным полюсам (VGP) напрямую в форматах <strong>.gpml</strong> и <strong>.vgp</strong>, которые напрямую поддерживаются соответственно программами GPlates и GMap."
      }
    },
    "graphics": {
      "title": "Работа с графикой",
      "lines": {
        "first": "Все графики и диаграммы, получаемые в ходе работы с данными в PMTools, максимально подготовлены для прямого использования их в статьях и презентациях. К тому же они являются векторными и могут быть легко открыты и отредактированы в любом векторном графическом редакторе."
      }
    },
    "dataManipulation": {
      "title": "Взаимодействие с данными",
      "lines": {
        "first": "Взаимодействие со всеми импортированными данными в PMTools основано на простой концепции: любое направление (точку) можно \"выбрать\". Вы можете выбрать направления (точки) прямо на графике, можете выбрать через таблицу, а можете и вовсе ввести их порядковые номера в специальное окно. Полная свобода выбора!",
        "second": "При этом, взаимодествуя с данными через графики, вы можете с комфортом использовать масштабирование и перемещение области видимости. А взаимодействуя с таблицами, можете фильтровать данные как вам угодно, по абсолютно любым столбцам и с обилием условий."
      }
    },
    "hotkeys": {
      "title": "Горячие клавиши",
      "lines": {
        "first": "Управление PMTools может осуществляться не только при помощи классического взаимодействия с графическим интерфейсом, но и при помощи горячих клавиш, которые, для вашего удобства, были частично заимствованы из пакета программ Р. Энкина для OS DOS, и в то же время являются редактируемыми — подстраивайте управления под себя!"
      }
    }
  },
  "authorsAndHistoryPage": {
    "headline": "Создатели PMTools",
    "ie": {
      "whois": "Иван Ефремов — разработчик PMTools.",
      "about": "Детальная информация по ссылкам ниже."
    },
    "rv": {
      "whois": "Роман Веселовский — инициатор проекта и научный консультант на всём пути разработки.",
      "about": "Профессор РАН, доктор геолого-минералогических наук, главный научный сотрудник Института Физики Земли РАН."
    },
    "historybutton": {
      "show": "Хочу посмотреть историю создания",
      "hide": "Не хочу смотреть историю создания"
    },
    "history": {
      "headline": "История создания PMTools",
      "shortdesc": "PMTools создавалсь чуть больше 2 лет, и при этом пару раз переписывалась с нуля.",
      "lines": {
        "first": "Это был май 2019 года. И имелась крайне простая идея — написать небольшую программу, которая будет строить стреограммы по результатам магнитных чисток. Нужно это было, потому что все имеющиеся программы, которые делали в том числе и это, выдавали на экспорт не особо удобные для последующего использования стереограммы, которые надо было долго вручную доделывать в графическом редакторе. Для реализации было решено использовать Python, Matplotlib, Pandas и PyQt5. Вот как примерно выглядели результаты недельной работы над этим:",
        "second": "Создав это стало понятно, что PyQT5 не подходит для поставленной задачи, как и Matplotlip. Потому начались поиски новых способов выполнения задачи. Рассматривались варианты на языках Python и C++. Все решения на C++ были чрезмерно сложными и было ясно, что на реализацию на этом языке ушло бы слишком много времени и сил. Потому был выбран Python. Спустя пару недель поиска и анализа подходящих для этого решений, среди библиотек и фреймворков выбор пал на Plotly. Эта компания имела на тот момент в своём арсенале одноименную библиотеку для построения графиков и зарождавшийся фреймворк для построения веб-приложений на Python — Dash. Таким образом, вооружившись Plotly и Dash, за лето 2019 года было создано вот это:",
        "third": "А за последующие месяцы в медленнем темпе производились небольшие доработки и вносились небольшие изменения:",
        "fourth": "Созданная программа была названа PMTools и она уже была чем-то большим, чем просто построителем стреограмм. Это уже было web-приложение для компонентного анализа, также оно давало возможность произвести расчёт среднего по Фишеру и построение соответствующей стереограммы, а также был создан небольшой палеомагнитный калькулятор. Однако, быстро стало понятно, что это не конечный продукт, а скорее alpha-версия.",
        "fifth": "До лета 2020 года было нужно решить, как делать следующую версию PMTools. Было понятно, что нечто действительно функциональное при помощи Plotly и Dash создать будет трудно, поскольку кастомизация всех встроенных графиков и других компонентов была бы слишком обширной и порой даже невыполнимой. Было принято решение написать следующую версию на чистом JavaScript. Как ориентир было взято аналогичное web-приложение с сайта paleomagnetism.org. Для ускорения разработки графики было решено строить при помощи готовых инструментов, был произведён анализ различных библиотек и фреймворков для построения графиков на JavaScript, и по итогу была выбрана библиотека HighCharts. При этом исследователи, для кого создавалась PMTools, просили сделать её десктопной, независимой от подключения к интернету. И потому было решено использовать Electron. За лето 2020 получилось следующее:",
        "sixth": "Новая версия PMTools уже позволяла проводить полный цикл палеомагнитных операций: компонентный анализ, статистику направлений, расчёт полюсов. Она была десктопной и независимой от подключения к интернету. Этой версией PMTools уже активно пользовались исследователи. Версия была обозначена как beta.",
        "seventh": "Однако были проблемы с производительностью. Тут стоит заметить, что хоть это и был 2020/2021 год, тем не менее, в PMTools широко использовалась библиотека jQuery и при этом были попытки реализовать модульность, которая, увы, не увенчалась успехом из-за архитектурных проблем на всех уровнях программы. Далее у автора был, в некотором смысле, творческий отпуск:",
        "eighth": "После этого отпуска было решено переписать PMTools на стеке TypeScript/React/Redux, сделать её полноценным web-приложением и временно отказаться от идеи десктопного приложения. В промежутке с февраля 2021 по май 2022 PMTools была создана с нуля на указанном стеке технологий, при этом все графики было решено сделать самостоятельно, без использования каких либо библиотек для их построения, поскольку именно при такой реализации достигался полный контроль за отображением данных. По итогу, в мае 2022 года, состоялся релиз PMTools v.2.0."
      }
    }
  },
  "appLayout": {
    "settings": {
      "settings": "Настройки",
      "help": "Справка",
      "import": "Загрузить файл",
      "export": "Экспортировать статистику"
    },
    "navPanel": {
      "PCA": "Магнитные чистки",
      "DIR": "Статистика направлений",
      "projectRepo": "Репозиторий проекта",
      "mainPage": "Главная страница"
    },
    "dropFiles": "Отпустите файлы для загрузки"
  },
  "importModal": {
    "import": "Загрузите файлы",
    "useExample": "Или воспользуйтесь примером",
    "useDnD": "Или перетащите файлы поверх приложения",
    "close": "Закрыть"
  },
  "pcaPage": {
    "metadataModal": {
      "apply": "Применить"
    },
    "tools": {
      "currentFile": {
        "title": "Текущий файл"
      },
      "coordinateSystem": {
        "title": "Система координат"
      },
      "statMethod": {
        "title": "Статистический метод"
      },
      "seeStats": {
        "title": "Смотреть статистику",
        "label": "По всем файлам"
      },
      "visibility": {
        "title": "Видимость"
      }
    }
  },
  "dirPage": {
    "tools": {
      "currentFile": {
        "title": "Текущий файл"
      },
      "coordinateSystem": {
        "title": "Система координат"
      },
      "statMethod": {
        "title": "Статистический метод"
      },
      "seeStats": {
        "title": "Смотреть статистику",
        "label": "По всем файлам"
      },
      "visibility": {
        "title": "Видимость"
      },
      "reverse": {
        "title": "Обращение"
      },
      "vgp": {
        "title": "По всем сайтам",
        "label": "Построить VGP"
      },
      "tests": {
        "title": "Проверка гипотез",
        "label": "Палеомагнитные тесты"
      }
    }
  },
  "settings": {
    "hotkeys": {
      "title": "Горячие клавиши",
      "buttonAlreadyUsed": "Клавиша уже используется",
      "statMethods": {
        "title": "Статистические методы"
      },
      "visibility": {
        "title": "Видимость точек",
        "hide": "Скрыть точки",
        "show": "Показать точки"
      },
      "reverse": {
        "title": "Обращение полярности направлений",
        "reversed": "Обратная полярность",
        "normal": "Прямая полярность"
      },
      "selection": {
        "title": "Выделение точек",
        "deleteSelection": "Убрать выделение"
      },
      "zoom": {
        "title": "Масштабирование графиков",
        "zoomInOut": "Изменение масштаба",
        "pan": "Перемещение области видимости"
      },
      "zijd": {
        "title": "Управление диграммой Зийдервельда",
        "right": "Переместиться вправо",
        "left": "Переместиться влево",
        "top": "Переместиться вверх",
        "bottom": "Переместиться вниз",
        "projection": {
          "scroll": "Прокручивание проекций"
        }
      },
      "coordinates": {
        "title": "Система координат",
        "scroll": "Прокручивание систем координат"
      },
      "fileSelector": {
        "title": "Выбор активного файла",
        "right": "Выбрать следующий файл",
        "left": "Выбрать предыдущий файл"
      },
      "titles": {
        "Статистические методы": "Статистические методы",
        "PCA": "PCA",
        "PCA0": "PCA0",
        "GC": "GC",
        "GCN": "GCN",
        "Fisher": "Fisher",
        "McFadden": "McFadden",
        "Видимость точек": "Видимость точек",
        "Скрыть точки": "Скрыть точки",
        "Показать точки": "Показать точки",
        "Обращение полярности направлений": "Обращение полярности направлений",
        "Обратная полярность": "Обратная полярность",
        "Прямая полярность": "Прямая полярность",
        "Выделение точек": "Выделение точек",
        "Убрать выделение": "Убрать выделение",
        "Масштабирование графиков": "Масштабирование графиков",
        "Изменение масштаба": "Изменение масштаба",
        "Перемещение области видимости": "Перемещение области видимости",
        "Управление диграммой Зийдервельда": "Управление диграммой Зийдервельда",
        "Переместиться вправо": "Переместиться вправо",
        "Переместиться влево": "Переместиться влево",
        "Переместиться вверх": "Переместиться вверх",
        "Переместиться вниз": "Переместиться вниз",
        "Прокручивание проекций": "Прокручивание проекций",
        "Система координат": "Система координат",
        "Прокручивание систем координат": "Прокручивание систем координат",
        "Выбор активного файла": "Выбор активного файла",
        "Выбрать следующий файл": "Выбрать следующий файл",
        "Выбрать предыдущий файл": "Выбрать предыдущий файл",
        "Сохранить": "Сохранить",
        "Вернуть по умолчанию": "Вернуть по умолчанию",
        "Настройки сохранены": "Настройки сохранены",
        "Установлены настройки по умолчанию": "Установлены настройки по умолчанию"
      }
    },
    "saveButton": "Сохранить",
    "toDefaultButton": "Вернуть по умолчанию",
    "onSaveMessage": "Настройки сохранены",
    "onDefaulSettings": "Установлены настройки по умолчанию"
  },
  "inputDirs": {
    "label": "Введите номера точек",
    "helper": "Валидные примеры:"
  },
  "inputComment": {
    "label": "Введите комментарий",
    "placeholder": "Любой текст"
  },
  "vgp": {
    "upload": {
      "button": "Загрузить файл",
      "first": "Введите или загрузите координаты сайтов",
      "second": "в файле обязательно должны быть столбцы ",
      "third": "Опциональными являются столбцы ",
      "fourth": ", они нужны для экспорта в формат "
    },
    "dataManipulation": {
      "clear": "Очистить",
      "calculate": "Рассчитать VGPs"
    }
  },
  "pmtests": {
    "controls": {
      "run": "Запустить тест",
      "running": "Тест запущен, производится моделирование..."
    },
    "foldTest": {
      "title": "Тест складки (Bootstrap-версия)",
      "first": "Наиболее плотная сгруппированность векторов (кучность, 95% доверительный интервал) наблюдается на:",
      "second": "При этом диапазон всех бутстреп-генераций следующий:"
    },
    "reverseAutoTest": {
      "title": "Тесты обращения (автоматические)",
      "first": "Bootstrap-вариант теста обращения [Tauxe, 2010]",
      "second": "Если области внутри границ 95%-го доверия (пунктирные линии) пересекаются во всех трёх компонентах, данные \"проходят\" тест обращения. В противном случае (нет пересечений) тест не пройден."
    },
    "reverseTest": {
      "title": "Тест обращения (ручной ввод)",
      "first": "Рассчитать",
      "required": "Поле обязательно"
    },
    "reverseTestResult": {
      "title": "Классический тест обращения [McFadden and McElhinny, 1990]",
      "tooltip": "Нажмите, чтобы скопировать"
    },
    "conglomerateTest": {
      "title": "Тест конгломератов",
      "first": "Тест проводится автоматически по отношению к текущему открытому файлу.",
      "second": "Результат теста:",
      "res": "ru"
    }
  },
  "graphsInfo": {
    "generalAdvice": {
      "title": "Общий совет",
      "line1": "Если элементы управления PMTools занимают слишком много места — уменьшите масштаб страницы, для этого используйте сочетание клавиш "
    },
    "zijd": {
      "zoomPan": {
        "title": "Масштабирование",
        "line1": "Доступно 2 варианта масштабирования: boundless и обычный",
        "line2": "Boundless zoom",
        "line3": "Используйте колесо мыши для масштабирования",
        "line4": "Для позиционирования используйте клавиши",
        "line5": "Для возвращения в исходное состояние используйте кнопку",
        "line6": "Только в этом режиме может изменяться Unit",
        "line7": "Обычное масштабирование",
        "line8": "Используйте колесо мыши для масштабирования",
        "line9": "Для позиционирования используйте левую клавишу мыши с зажатой клавишей "
      },
      "selecting": {
        "title": "Выделение точек",
        "line1": "Доступно 4 варианта выделения (выбора) точек (шагов чистки):",
        "line2": "Зажмите левую клавишу мыши и выделите область на графике",
        "line3": "Левой клавишей мыши нажмите на нужную точку на графике",
        "line4": "Левой клавишей мыши нажмите на нужную точку (строку) в таблице",
        "line5": "Введите номера точек в поле ввода*",
        "line6": "Совет: для сочетания первых двух способов выделения или для выбора интервала точек в таблице используйте зажатую клавишу ",
        "line7": "* Поле ввода появляется при использовании стат. метода или при скрытии точек, когда ни одна точка ещё не была выбрана"
      },
      "interactiveLegend": {
        "title": "Интерактивная легенда",
        "line1": "При наведении курсором мыши на легенду, соответствующая функция на графике меняет стиль, а при нажатии на элемент легенды можно регулировать видимость функции*",
        "line2": "* Не влияет на экспортируемый график"
      }
    },
    "stereoAndMagAndStereoDir": {
      "zoomPan": {
        "title": "Масштабирование",
        "line1": "Доступен только обычный вариант масштабирования",
        "line2": "Обычное масштабирование",
        "line3": "Используйте колесо мыши для масштабирования",
        "line4": "Для позиционирования используйте левую клавишу мыши с зажатой клавишей "
      },
      "selecting": {
        "title": "Выделение точек",
        "line1": "Доступно 4 варианта выделения (выбора) точек (направлений):",
        "line2": "Зажмите левую клавишу мыши и выделите область на графике",
        "line3": "Левой клавишей мыши нажмите на нужную точку на графике",
        "line4": "Левой клавишей мыши нажмите на нужную точку (строку) в таблице",
        "line5": "Введите номера точек в поле ввода*",
        "line6": "Совет: для сочетания первых двух способов выделения или для выбора интервала точек в таблице используйте зажатую клавишу ",
        "line7": "* Поле ввода появляется при использовании стат. метода или при скрытии точек, когда ни одна точка ещё не была выбрана"
      }
    },
    "stereoVGP": {
      "zoomPan": {
        "title": "Масштабирование",
        "line1": "Доступен только обычный вариант масштабирования",
        "line2": "Обычное масштабирование",
        "line3": "Используйте колесо мыши для масштабирования",
        "line4": "Для позиционирования используйте левую клавишу мыши с зажатой клавишей "
      },
      "selecting": {
        "title": "Выделение точек",
        "line1": "Доступно 2 варианта выделения (выбора) точек (направлений):",
        "line2": "Зажмите левую клавишу мыши и выделите область на графике",
        "line3": "Левой клавишей мыши нажмите на нужную точку на графике",
        "line6": "Совет: для сочетания двух способов выделения используйте зажатую клавишу "
      }
    }
  },
  "helper": {
    "issues": "Если вы столкнулись с ошибкой при работе с PMTools, пожалуйста, создайте об этом issue в репозитории PMTools на GitHub",
    "blankScreen": "В случае если на страницах PCA/DIR (pmtools.ru/app/pca и https://pmtools.ru/app/dir соответственно) вы видите пустые белые экраны, то попробуйте нажать на кнопку ниже – она очистит содержимое вашего локального хранилища для сайта PMTools.",
    "clearLocalStorage": "❗❗❗Имейте ввиду, что это удалит ВСЕ имеющися в локальном хранилище записи, в том числе и сохраненные туда автоматически загруженные данные файлов и результаты их статистической обработки, а также ваши настройки ваших горячих клавиш."
  }
}

